#include "stdafx.h"
#include "AreaCode.h"

////////////////////////////////////////////////////////////////////////////////
#ifdef _USE_AAC_

const CString AAC::m_CITY_00[] = {
	_T("---"), 
	_T("北京"), _T("0010"),
	_T("上海"), _T("0021"),
	_T("天津"), _T("0022"),
	_T("重庆"), _T("0023")
// 	_T("香港"), _T("0852"),
// 	_T("澳门"), _T("0853")
};

const CString AAC::m_CITY_01[] = {
    _T("安徽"),
    _T("安庆"), _T("0556"),
    _T("蚌埠"), _T("0552"),
    _T("巢湖"), _T("0565"),
    _T("滁州"), _T("0550"),
    _T("阜阳"), _T("0558"),
    _T("贵池"), _T("0566"),
    _T("合肥"), _T("0551"),
    _T("淮北"), _T("0561"),
    _T("淮南"), _T("0554"),
    _T("黄山"), _T("0559"),
    _T("六安"), _T("0564"),
    _T("马鞍山"), _T("0555"),
    _T("宿州"), _T("0557"),
    _T("铜陵"), _T("0562"),
    _T("芜湖"), _T("0553"),
    _T("宣城"), _T("0563")
};

const CString AAC::m_CITY_02[] = {
    _T("福建"),
    _T("福州"), _T("0591"),
//     _T("晋江"), _T("0595"),
    _T("龙岩"), _T("0597"),
    _T("南平"), _T("0599"),
    _T("宁德"), _T("0593"),
    _T("莆田"), _T("0594"),
    _T("泉州"), _T("0595"),
    _T("三明"), _T("0598"),
    _T("厦门"), _T("0592"),
    _T("漳州"), _T("0596")
};

const CString AAC::m_CITY_03[] = {
    _T("甘肃"),
    _T("白银"), _T("0943"),
    _T("定西"), _T("0932"),
    _T("甘南州"), _T("0941"),
    _T("酒泉"), _T("0937"),
    _T("兰州"), _T("0931"),
    _T("临夏"), _T("0930"),
    _T("平凉"), _T("0933"),
    _T("天水"), _T("0938"),
    _T("武威"), _T("0935"),
    _T("西峰"), _T("0934"),
    _T("张掖"), _T("0936")
};

const CString AAC::m_CITY_04[] = {
    _T("广东"),
    _T("潮阳"), _T("0661"),
    _T("潮州"), _T("0768"),
    _T("东莞"), _T("0769"),
    _T("佛山"), _T("0757"),
    _T("广州"), _T("0020"),
    _T("河源"), _T("0762"),
    _T("惠州"), _T("0752"),
    _T("揭西"), _T("0663"),
    _T("梅州"), _T("0753"),
    _T("清远"), _T("0763"),
    _T("汕头"), _T("0754"),
    _T("汕尾"), _T("0660"),
    _T("韶关"), _T("0751"),
    _T("深圳"), _T("0755"),
    _T("顺德"), _T("0765"),
    _T("阳江"), _T("0662"),
    _T("云浮"), _T("0766"),
    _T("湛江"), _T("0759"),
    _T("肇庆"), _T("0758"),
    _T("中山"), _T("0760"),
    _T("珠海"), _T("0756")
};

const CString AAC::m_CITY_05[] = {
    _T("广西"),
    _T("百色"), _T("0776"),
    _T("北海"), _T("0779"),
    _T("防城港"), _T("0770"),
    _T("桂林"), _T("0773"),
    _T("河池"), _T("0778"),
    _T("柳州"), _T("0772"),
    _T("南宁"), _T("0771"),
    _T("钦州"), _T("0777"),
    _T("梧州"), _T("0774"),
    _T("玉林"), _T("0775")
};

const CString AAC::m_CITY_06[] = {
    _T("贵州"),
    _T("安顺"), _T("0853"),
    _T("毕节"), _T("0857"),
    _T("都均"), _T("0854"),
    _T("贵阳"), _T("0851"),
    _T("凯里"), _T("0855"),
    _T("六盘水"), _T("0858"),
    _T("铜仁"), _T("0856"),
    _T("兴义"), _T("0859"),
    _T("遵义"), _T("0852")
};

const CString AAC::m_CITY_07[] = {
    _T("海南"),
    _T("儋州"), _T("0890"),
    _T("海口"), _T("0898"),
    _T("三亚"), _T("0899")
};

const CString AAC::m_CITY_08[] = {
    _T("河北"),
    _T("保定"), _T("0312"),
    _T("沧州"), _T("0317"),
    _T("承德"), _T("0314"),
    _T("邯郸"), _T("0310"),
    _T("衡水"), _T("0318"),
    _T("廊坊"), _T("0316"),
    _T("秦皇岛"), _T("0335"),
    _T("石家庄"), _T("0311"),
    _T("唐山"), _T("0315"),
    _T("邢台"), _T("0319"),
    _T("张家口"), _T("0313")
};

const CString AAC::m_CITY_09[] = {
    _T("河南"),
    _T("安阳"), _T("0372"),
    _T("鹤壁"), _T("0392"),
    _T("焦作"), _T("0391"),
    _T("开封"), _T("0378"),
    _T("洛阳"), _T("0379"),
    _T("漯河"), _T("0395"),
    _T("南阳"), _T("0377"),
    _T("平顶山"), _T("0375"),
    _T("濮阳"), _T("0393"),
    _T("三门峡"), _T("0398"),
    _T("商丘"), _T("0370"),
    _T("新乡"), _T("0373"),
    _T("信阳"), _T("0376"),
    _T("许昌"), _T("0374"),
    _T("郑州"), _T("0371"),
    _T("周口"), _T("0394"),
    _T("驻马店"), _T("0396")
};

const CString AAC::m_CITY_10[] = {
    _T("黑龙江"),
    _T("阿城"), _T("0450"),
    _T("大庆"), _T("0459"),
    _T("哈尔滨"), _T("0451"),
    _T("黑河"), _T("0456"),
    _T("加格达奇"), _T("0457"),
    _T("佳木斯"), _T("0454"),
    _T("牡丹江"), _T("0453"),
    _T("齐齐哈尔"), _T("0452"),
    _T("绥化"), _T("0455"),
    _T("伊春"), _T("0458")
};

const CString AAC::m_CITY_11[] = {
    _T("湖北"),
    _T("鄂州"), _T("0711"),
    _T("恩施"), _T("0718"),
    _T("黄石"), _T("0714"),
    _T("黄州"), _T("0713"),
    _T("江汉"), _T("0728"),
    _T("荆门"), _T("0724"),
    _T("荆沙"), _T("0716"),
    _T("十堰"), _T("0719"),
    _T("随枣"), _T("0722"),
    _T("武汉"), _T("0027"),
    _T("咸宁"), _T("0715"),
    _T("襄城"), _T("0710"),
    _T("孝感"), _T("0712"),
    _T("宜昌"), _T("0717")
};

const CString AAC::m_CITY_12[] = {
    _T("湖南"),
    _T("长沙"), _T("0731"),
    _T("常德"), _T("0736"),
    _T("郴州"), _T("0735"),
    _T("衡阳"), _T("0734"),
    _T("怀化"), _T("0745"),
    _T("吉首"), _T("0743"),
    _T("娄底"), _T("0738"),
    _T("邵阳"), _T("0739"),
    _T("湘潭"), _T("0732"),
    _T("益阳"), _T("0737"),
    _T("永州冷"), _T("0746"),
    _T("岳阳"), _T("0730"),
    _T("张家界"), _T("0744"),
    _T("株州"), _T("0733")
};

const CString AAC::m_CITY_13[] = {
    _T("吉林"),
    _T("白城"), _T("0436"),
    _T("长春"), _T("0431"),
    _T("珲春"), _T("0440"),
    _T("浑江"), _T("0439"),
    _T("吉林"), _T("0432"),
    _T("辽源"), _T("0437"),
    _T("四平"), _T("0434"),
    _T("松原"), _T("0438"),
    _T("通化"), _T("0435"),
    _T("延吉"), _T("0433")
};

const CString AAC::m_CITY_14[] = {
    _T("江苏"),
    _T("常州"), _T("0519"),
//     _T("淮安"), _T("0517"),
    _T("淮阴"), _T("0517"),
    _T("连云港"), _T("0518"),
    _T("南京"), _T("0025"),
    _T("南通"), _T("0513"),
    _T("苏州"), _T("0512"),
    _T("泰州"), _T("0523"),
    _T("无锡"), _T("0510"),
    _T("徐州"), _T("0516"),
    _T("盐城"), _T("0515"),
    _T("扬州"), _T("0514"),
    _T("镇江"), _T("0511")
};

const CString AAC::m_CITY_15[] = {
    _T("江西"),
    _T("赣州"), _T("0797"),
    _T("吉安"), _T("0796"),
    _T("景德镇"), _T("0798"),
    _T("九江"), _T("0792"),
    _T("临川"), _T("0794"),
    _T("南昌"), _T("0791"),
    _T("萍乡"), _T("0799"),
    _T("上饶"), _T("0793"),
    _T("新余"), _T("0790"),
    _T("宜春"), _T("0795"),
    _T("鹰潭"), _T("0701")
};

const CString AAC::m_CITY_16[] = {
    _T("辽宁"),
    _T("鞍山"), _T("0412"),
    _T("本溪"), _T("0414"),
    _T("朝阳"), _T("0421"),
    _T("大连"), _T("0411"),
    _T("丹东"), _T("0415"),
    _T("抚顺"), _T("0413"),
    _T("阜新"), _T("0418"),
    _T("葫芦岛"), _T("0429"),
    _T("锦州"), _T("0416"),
    _T("辽阳"), _T("0419"),
    _T("盘锦"), _T("0427"),
    _T("沈阳"), _T("0024"),
    _T("铁岭"), _T("0410"),
    _T("营口"), _T("0417")
};

const CString AAC::m_CITY_17[] = {
    _T("内蒙古"),
    _T("阿拉善左旗"), _T("0483"),
    _T("包头"), _T("0472"),
    _T("赤峰"), _T("0476"),
    _T("东胜"), _T("0477"),
    _T("海拉尔"), _T("0470"),
    _T("呼和浩特"), _T("0471"),
    _T("集宁"), _T("0474"),
    _T("临河"), _T("0478"),
    _T("通辽"), _T("0475"),
    _T("乌海"), _T("0473"),
    _T("乌兰浩特"), _T("0482"),
    _T("锡林浩特"), _T("0479")
};

const CString AAC::m_CITY_18[] = {
    _T("宁夏"),
    _T("固原"), _T("0954"),
    _T("石嘴山"), _T("0952"),
    _T("吴忠"), _T("0953"),
    _T("银川"), _T("0951")
};

const CString AAC::m_CITY_19[] = {
    _T("青海"),
    _T("德令哈"), _T("0977"),
    _T("共和"), _T("0974"),
    _T("海东"), _T("0972"),
    _T("玛沁"), _T("0975"),
    _T("同仁"), _T("0973"),
    _T("西宁"), _T("0971"),
    _T("玉树"), _T("0976")
};

const CString AAC::m_CITY_20[] = {
    _T("山东"),
    _T("德州"), _T("0534"),
    _T("菏泽"), _T("0530"),
    _T("淮坊"), _T("0536"),
    _T("济南"), _T("0531"),
    _T("济宁"), _T("0537"),
    _T("临沂"), _T("0539"),
    _T("青岛"), _T("0532"),
    _T("泰安"), _T("0538"),
    _T("烟台"), _T("0535"),
    _T("枣庄"), _T("0632"),
    _T("淄博"), _T("0533")
};

const CString AAC::m_CITY_21[] = {
    _T("山西"),
    _T("长治"), _T("0355"),
    _T("大同"), _T("0352"),
    _T("晋城"), _T("0356"),
    _T("离石"), _T("0358"),
    _T("临汾"), _T("0357"),
    _T("太原"), _T("0351"),
    _T("忻州"), _T("0350"),
    _T("阳泉"), _T("0353"),
    _T("榆次"), _T("0354"),
    _T("运城"), _T("0359")
};

const CString AAC::m_CITY_22[] = {
    _T("陕西"),
    _T("安康"), _T("0915"),
    _T("宝鸡"), _T("0917"),
    _T("汉中"), _T("0916"),
    _T("商洛"), _T("0914"),
    _T("铜川"), _T("0919"),
    _T("渭南"), _T("0913"),
    _T("西安"), _T("0029"),
    _T("咸阳"), _T("0910"),
    _T("延安"), _T("0911"),
    _T("榆林"), _T("0912")
};

const CString AAC::m_CITY_23[] = {
    _T("四川"),
    _T("巴中"), _T("0827"),
    _T("成都"), _T("0028"),
    _T("达县"), _T("0818"),
    _T("德阳"), _T("0838"),
    _T("涪陵"), _T("0810"),
    _T("广安"), _T("0826"),
    _T("广元"), _T("0839"),
    _T("康定"), _T("0836"),
    _T("乐山"), _T("0833"),
    _T("泸州"), _T("0830"),
    _T("泸州"), _T("0840"),
    _T("马尔康"), _T("0837"),
    _T("绵阳"), _T("0816"),
    _T("内江"), _T("0832"),
    _T("南充"), _T("0817"),
    _T("攀枝花"), _T("0812"),
    _T("遂宁"), _T("0825"),
    _T("万县"), _T("0819"),
    _T("西昌"), _T("0834"),
    _T("雅安"), _T("0835"),
    _T("宜宾"), _T("0831"),
    _T("永川"), _T("0814"),
    _T("重庆"), _T("0811"),
    _T("自贡"), _T("0813")
};

const CString AAC::m_CITY_24[] = {
    _T("西藏"),
    _T("拉萨"), _T("0891"),
    _T("日喀则"), _T("0892"),
    _T("山南"), _T("0893")
};

const CString AAC::m_CITY_25[] = {
    _T("新疆"),
    _T("乌鲁木齐"), _T("0991")
};

const CString AAC::m_CITY_26[] = {
    _T("云南"),
    _T("保山"), _T("0875"),
    _T("楚雄"), _T("0878"),
    _T("大理"), _T("0872"),
    _T("东川"), _T("0881"),
    _T("个旧"), _T("0873"),
    _T("景洪"), _T("0691"),
    _T("昆明"), _T("0871"),
    _T("丽江"), _T("0888"),
    _T("临沧"), _T("0883"),
    _T("六库"), _T("0886"),
    _T("潞西"), _T("0692"),
    _T("曲靖"), _T("0874"),
    _T("思茅"), _T("0879"),
    _T("文山"), _T("0876"),
    _T("玉溪"), _T("0877"),
    _T("昭通"), _T("0870"),
    _T("中甸"), _T("0887")
};

const CString AAC::m_CITY_27[] = {
    _T("浙江"),
    _T("杭州"), _T("0571"),
    _T("湖州"), _T("0572"),
    _T("嘉兴"), _T("0573"),
    _T("金华"), _T("0579"),
    _T("丽水"), _T("0578"),
    _T("宁波"), _T("0574"),
    _T("衢州"), _T("0570"),
    _T("绍兴"), _T("0575"),
    _T("台州"), _T("0576"),
    _T("温州"), _T("0577"),
    _T("舟山"), _T("0580")
};

////////////////////////////////////////////////////////////////////////////////

const CString* AAC::m_PTR[] = {
	m_CITY_00,
	m_CITY_01,
	m_CITY_02,
	m_CITY_03,
	m_CITY_04,
	m_CITY_05,
	m_CITY_06,
	m_CITY_07,
	m_CITY_08,
	m_CITY_09,
	m_CITY_10,
	m_CITY_11,
	m_CITY_12,
	m_CITY_13,
	m_CITY_14,
	m_CITY_15,
	m_CITY_16,
	m_CITY_17,
	m_CITY_18,
	m_CITY_19,
	m_CITY_20,
	m_CITY_21,
	m_CITY_22,
	m_CITY_23,
	m_CITY_24,
	m_CITY_25,
	m_CITY_26,
	m_CITY_27
};

const int AAC::m_NUM[] = {
	(sizeof(m_CITY_00) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_01) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_02) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_03) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_04) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_05) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_06) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_07) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_08) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_09) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_10) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_11) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_12) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_13) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_14) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_15) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_16) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_17) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_18) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_19) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_20) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_21) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_22) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_23) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_24) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_25) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_26) / sizeof(CString) - 1) >> 1,
	(sizeof(m_CITY_27) / sizeof(CString) - 1) >> 1
};

////////////////////////////////////////////////////////////////////////////////

const int AAC::FindProvince(const CString &str)
{
	for(int i = 0; i < PROV_NUM; ++i)
	{
		if( -1 != str.Find( GetProvince(i) ) )
			return i;
	}
	return -1;
}

const int AAC::FindCity(const CString &str)
{
	for(int i = 0; i < PROV_NUM; ++i)
	{
		for(int j = 0; j < GetNum(i); ++j)
		{
			if( -1 != str.Find( GetCity(i, j) ) )
				return i * 100 + j;
		}
	}
	return -1;	
}

const int AAC::FindCode(const CString &str)
{
	for(int i = 0; i < PROV_NUM; ++i)
	{
		for(int j = 0; j < GetNum(i); ++j)
		{
			if( str == GetCode(i, j) )
				return i * 100 + j;
		}
	}
	return -1;	
}

#endif // _USE_AAC_
////////////////////////////////////////////////////////////////////////////////
